{
  "basics": {
    "name": "Antonio Hernández Coarasa",
    "label": "Director de Ingeniería - CTO",
    "image": "./ahercoa.jpg",
    "email": "ahercoa@gmail.com",
    "phone": "+34 699625413",
    "url": "https://samll.github.io/",
    "summary": "Líder tecnológico dinámico con más de 10 años de experiencia gestionando equipos internacionales multifuncionales y liderando proyectos estratégicos en los sectores IT, Automoción y AgTech sostenible. Experto en impulsar la Transformación Digital, optimizar Sistemas Empresariales y entregar soluciones innovadoras.",
    "location": {
      "postalCode": "08028",
      "city": "Barcelona",
      "countryCode": "ES"
    },
    "profiles": [{
      "network": "LinkedIn",
      "username": "Antonio Hernández Coarasa",
      "url": "https://www.linkedin.com/in/ahercoa/"
    }]
  },
  "qrCode": "path/to/qr_code.png",
  "aboutMe": "Líder tecnológico dinámico con más de 10 años de experiencia gestionando equipos internacionales multifuncionales y liderando proyectos estratégicos en los sectores IT, Automoción y AgTech sostenible. Experto en impulsar la Transformación Digital, optimizar Sistemas Empresariales y entregar soluciones innovadoras.",
  "workExperience": [
    {
      "position": "Director de IT",
      "startDate": "1/1/2023",
      "endYear": null,
      "company": "CBC Iberia - División Biogard",
      "logo": "./cbc_logo.png",
      "tasks": [
        "Puesto desempeñado en paralelo con la dirección de la Unidad de Negocio de Agro Electrónica, reportando directamente al CEO.",
        "Gestión y ejecución de más de 10 operaciones IT (Python + JS para integración de APIs) junto con el equipo de especialistas IT.",
        "Lideré la integración del ERP con el Marketplace online y la Logística tras una fusión, logrando la integración completa en 6 meses.",
        "Gestión de un equipo multidisciplinar de más de 10 especialistas IT (internos y externos), reduciendo la carga de trabajo en un 17%.",
        "Automatización de operaciones IT integrando M365 AzureID para monitoreo de datos y seguridad.",
        "Lideré la mejora continua de la infraestructura IT garantizando una seguridad robusta, reduciendo los incidentes en más del 50%."
      ],
      "projects": [
        {
          "title": "Migración de GWorkspace a M365",
          "description": "Transición de GWorkspace a M365, incluyendo integración con Azure AD para monitoreo de datos y seguridad."
        },
        {
          "title": "Integración de Business Central y Power BI",
          "description": "Integración de Business Central y Power BI para análisis y generación de informes en tiempo real."
        }
      ],
      "skills": [
        "Dirección Técnica (CTO)",
        "Planificación de Recursos Empresariales (ERP)",
        "Infraestructura Tecnológica de la Información",
        "Gestión de IT",
        "Microsoft Power BI",
        "Estandarización de Procesos",
        "Gestión de Seguridad"
      ]
    },
    {
      "position": "Director de la Unidad de Negocio Agro Electrónica",
      "startDate": "6/21/2021",
      "endDate": null,
      "company": "CBC Iberia - División Biogard",
      "logo": "./agro_electronics_logo.png",
      "tasks": [
        "Gestión completa del portafolio y roadmap AgTech de CBC Iberia directamente con el CEO.",
        "Miembro del Comité de Innovación del equipo europeo (incluyendo liderazgo de la PMO).",
        "Lideré el desarrollo de soluciones AgTech basadas en webGIS, IoT, IA y tecnología cloud, desde la investigación de mercado hasta la industrialización.",
        "Desarrollo de la estrategia de mercado y portafolio para 4 líneas de producto (3 comercializadas).",
        "Dirección de más de 30 profesionales multifuncionales en Europa para proyectos estratégicos de la compañía.",
        "Lanzamiento de sistemas IoT para control de plagas, reduciendo el uso de pesticidas en un 80% y los costes en un 50%."
      ],
      "projects": [
        {
          "title": "CDTI Mister 4.0",
          "description": "Integración de trampas electrónicas y estaciones meteorológicas (IoT con AWS IoT Core) con aerosoles de confusión sexual para control de Lobesia botrana en viñedos (proyecto financiado por el CDTI)."
        },
        {
          "title": "CDTI Pentrap",
          "description": "Sistema de control de plagas biotremológico multispecie para Pentatomidae (proyecto financiado por el CDTI)."
        },
        {
          "title": "SIGIS",
          "description": "Adaptación de modelos de Lobesia botrana a la región de La Rioja para optimizar los sistemas de liberación de feromonas."
        },
        {
          "title": "Plataforma Web BiogardGIS",
          "description": "Gestión continua de BiogardGIS, plataforma web para control remoto de dispositivos IoT y análisis de datos sobre la presión de plagas en diferentes cultivos."
        },
        {
          "title": "Sistema de Trampas Biogard Bucket",
          "description": "Lideré el desarrollo de trampas IoT para control de plagas, desde el concepto hasta la industrialización."
        }
      ],
      "skills": [
        "Soluciones AgTech",
        "Desarrollo de Negocio",
        "Desarrollo de Planes de Negocio",
        "Liderazgo de Equipos Multifuncionales",
        "Gestión de la Innovación",
        "Investigación de Mercado",
        "Estrategia de Marketing",
        "Gestión de Producto",
        "Gestión de Proyectos",
        "Análisis y Reporte"
      ]
    },
    {
      "position": "Project Manager de Ingeniería MHE",
      "startDate": "7/12/2020",
      "endDate": "6/21/2021",
      "company": "Amazon",
      "logo": "amazon_logo.png",
      "tasks": [
        "Lideré la optimización a gran escala de operaciones de centros logísticos. Entregué dos centros completos en España y documenté propuestas para tres más en Reino Unido.",
        "Experto en maquinaria de etiquetado de líneas de recepción, gestión IoT y mantenimiento predictivo.",
        "Lideré revisiones de diseño y soluciones técnicas cumpliendo con los estándares globales.",
        "Gestión de la ruta crítica y coordinación de proveedores.",
        "Entrega de proyectos de ingeniería y construcción dentro del plazo establecido."
      ],
      "projects": [
        {
          "title": "MAD9 - Alcalá de Henares - Fase de Ejecución",
          "description": "Gestión del despliegue de transportadores y estanterías de gran altura (+10m) para el nuevo centro logístico de Amazon en España."
        },
        {
          "title": "BHX2 - Birmingham - Fase de Diseño",
          "description": "Diseño de refactorización de un brownfield para aumentar la capacidad cúbica y mejorar la eficiencia operativa. Incluye plan de viabilidad técnica y financiera."
        },
        {
          "title": "BCN3 - Barcelona - Fase de Ejecución",
          "description": "Proyecto de conversión AMXL desde Pantry. Implementación de estanterías altas en brownfield activo."
        }
      ],
      "skills": [
        "Dirección Técnica",
        "Desarrollo de Negocio",
        "Desarrollo de Planes de Negocio",
        "Liderazgo de Equipos Multifuncionales",
        "Gestión de Proyectos",
        "Análisis y Reporte"
      ]
    },
    {
      "position": "Project Manager Senior de Automoción",
      "startDate": "11/3/2014",
      "endDate": "7/12/2020",
      "company": "Ficosa",
      "logo": "ficosa_logo.png",
      "tasks": [
        "Evolución de carrera desde Desarrollador de Software (2014-2016) a Líder de Software (2016-2017) y Project Manager (2017-2020), reportando al Director de Ingeniería.",
        "Lideré equipos de desarrollo para clientes internacionales (Nissan, Harley Davidson, Renault), gestionando hasta 80 ingenieros entre Software, Hardware, Mecánica, RF, QA y Producción.",
        "Gestión de proyectos en cascada y Agile (Scrum), incluyendo desarrollo SW, HW, validación/QA y diseño para manufactura.",
        "Interfaz directa con múltiples stakeholders internos (Comité de Dirección, I+D, Producción) y externos (proveedores y clientes finales - Renault, Nissan, Harley Davidson).",
        "Gestión de proyectos de extremo a extremo, desde RFP hasta entrega, solicitudes de cambio y planes de contingencia.",
        "Definición y liderazgo de planes de mitigación y contingencia.",
        "Portafolio de proyectos de Unidades Telemáticas (TCU) eCall y V2X, incluyendo integración con Infotainment.",
        "Gestión (y desarrollo directo) de modelo V-Spice completo para trazabilidad de requisitos a pruebas."
      ],
      "projects": [
        {
          "title": "Harley Davidson - Livewire - 2020/2021",
          "description": "Lideré el desarrollo de la Unidad de Control Telemático para la primera motocicleta eléctrica de Harley Davidson."
        },
        {
          "title": "Nissan Gen2 y Plataformas KAI",
          "description": "Lideré el desarrollo de la Unidad de Control Telemático para las nuevas plataformas Nissan Gen2 y KAI."
        },
        {
          "title": "Renault SL8 Refactor",
          "description": "Lideré el rediseño y recertificación del modelo SL8 para el mercado ruso."
        }
      ],
      "skills": [
        "Dirección Técnica",
        "Ingeniería Electrónica Embebida",
        "Gestión de Proyectos",
        "Resolución de Problemas",
        "Requisitos Técnicos",
        "Control de Calidad",
        "Colaboración entre Equipos",
        "Levantamiento de Requisitos",
        "Ciclo de Vida de Desarrollo de Software (SDLC)",
        "Metodologías Waterfall y Scrum",
        "Jira / Confluence"
      ]
    },
    {
      "position": "Ingeniero de Firmware de Seguridad Automotriz",
      "startDate": "9/9/2012",
      "endDate": "11/3/2014",
      "company": "Lear Corporation",
      "logo": "lear_logo.png",
      "tasks": [
        "Desarrollo de sistemas embebidos para aplicaciones automotrices bajo norma ISO-26262.",
        "Lideré la estandarización, definición, diseño, implementación, validación y despliegue de software crítico de seguridad.",
        "Desarrollé drivers para proyectos heredados en reemplazo de chips HW garantizando la continuidad del negocio."
      ],
      "projects": [
        {
          "title": "Plataforma Lear FuSi FW",
          "description": "Desarrollo del firmware para la plataforma Lear FuSi, incluyendo todos los componentes de autodiagnóstico y control del sistema para garantizar operación segura y modo de fallo controlado."
        }
      ],
      "skills": [
        "ISO26262",
        "C ANSI",
        "Colaboración entre Equipos",
        "Levantamiento de Requisitos",
        "Ciclo de Vida de Desarrollo de Software (SDLC)",
        "Metodología Waterfall",
        "Jira / Confluence"
      ]
    }
  ],
  "education": [
    {
      "degree": "Executive MBA",
      "startDate": "11/8/2019",
      "endDate": "1/21/2021",
      "institution": "EADA Business School",
      "logo": "eada_logo.png",
      "subjects": [
        "Análisis Financiero",
        "Estrategia de Marketing",
        "Estrategia Empresarial",
        "Gestión de Operaciones",
        "Análisis y Optimización Logística",
        "Gestión de la Innovación",
        "Transformación Digital",
        "Emprendimiento",
        "Liderazgo y Gestión de Personas"
      ],
      "project": {
        "title": "Safenodes",
        "description": "Definición completa de un plan de negocio para trazabilidad y auditoría de la cadena de valor del mercado de lujo, basado en tecnología Blockchain."
      }
    },
    {
      "degree": "Ingeniería de Telecomunicaciones (Grado y Máster)",
      "startDate": "9/15/2005",
      "endDate": "6/30/2012",
      "institution": "Telecom UPC",
      "logo": "upc_logo.png",
      "subjects": [
        "Matemáticas",
        "Física",
        "Electrónica",
        "Redes",
        "Comunicaciones de Radiofrecuencia",
        "Informática",
        "Procesamiento de Señal",
        "Sistemas de Control",
        "Ingeniería de Software",
        "Gestión de Proyectos"
      ],
      "project": {
        "title": "Impacto de fuentes transmisoras móviles en la recolección de energía por radiofrecuencia @ Northeastern University (Boston, MA)",
        "description": "Modelo matemático para distintas propuestas de distribución de energía mediante robots en espacio abierto para optimizar la vida útil de sensores en redes WSAN.",
        "link": "https://upcommons.upc.edu/handle/2099.1/16093"
      }
    },
    {
      "degree": "Ingeniería Electrónica (Grado y Máster)",
      "startDate": "9/15/2005",
      "endDate": "6/30/2011",
      "institution": "Telecom UPC",
      "logo": "upc_logo.png",
      "subjects": [
        "Diseño de Electrónica Digital",
        "Diseño de Electrónica Analógica",
        "Sistemas Embebidos",
        "Microcontroladores",
        "Electrónica de Potencia",
        "Electrónica de RF",
        "Sistemas de Control",
        "Ingeniería de Software"
      ],
      "project": {
        "title": "Depósito y caracterización de capas de Teflón sobre Silicio para la realización de dispositivos EWOD",
        "description": "Análisis del impacto de las diferentes fases de aplicación de Teflón sobre obleas de silicio para crear dispositivos de electrowetting, incluyendo diseño, implementación, banco de pruebas y análisis de resultados.",
        "link": "https://upcommons.upc.edu/handle/2099.1/12314"
      }
    }
  ],
  "honoursAndAwards": [
    {
      "title": "Premio al Mejor Artículo ICNC'13",
      "year": 2013,
      "details": "Premio otorgado por la publicación sobre recolección de energía IoT: 'Impact of Mobile Transmitter Sources on Radio Frequency Wireless Energy Harvesting'.",
      "link": "https://ieeexplore.ieee.org/document/6504149"
    }
  ]
}
